12/data/attachments/b99c7d75d95562bb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fd25bb4d-253c-4c0f-9cdd-228e9f773737</nif:username>
            <nif:friendToBeAdded>Lauren_interest_Friend_98396_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>